trade/src/Catalogs/НастройкиПодключенияКСистемеБыстрыхПлатежей/НастройкиПодключенияКСистемеБыстрыхПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиПодключенияКСистемеБыстрыхПлатежей</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИдентификаторМерчанта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>140</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПлатежнаяСистема</name>
    <type>
      <types>EnumRef.УдалитьПлатежныеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаПеренаправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНастройки</name>
    <type>
      <types>EnumRef.ВариантыНастройкиСБП</types>
    </type>
  </attributes>
</mdclass:Catalog>

trade/src/Enums/ВариантыНастройкиСБП/ВариантыНастройкиСБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыНастройкиСБП</name>
  <enumValues>
    <name>b2b</name>
  </enumValues>
  <enumValues>
    <name>c2b</name>
  </enumValues>
</mdclass:Enum>

trade/src/Catalogs/НастройкиПодключенияКСистемеБыстрыхПлатежей/Forms/ФормаВыбора/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КорневаяГруппа = Неопределено;
	СкрытьНастройки = Ложь;
	Если ЗначениеЗаполнено(Параметры.ВариантНастройки) Тогда
		ВариантНастройки = Перечисления.ВариантыНастройкиСБП[Параметры.ВариантНастройки];
		КорневаяГруппа = Справочники.НастройкиПодключенияКСистемеБыстрыхПлатежей.ГруппаВариантНастройки(
			ВариантНастройки,
			Ложь,
			Ложь);
		Если Не ЗначениеЗаполнено(КорневаяГруппа) Тогда
			СкрытьНастройки = Истина;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьУсловноеОформление(
		КорневаяГруппа,
		СкрытьНастройки);
	
	Результат = ОбновлениеИнформационнойБазы.ОбъектОбработан(
		"Справочник.НастройкиПодключенияКСистемеБыстрыхПлатежей");
	
	Если Не Результат.Обработан Тогда
		ТолькоПросмотр = Истина;
		Элементы.Список.Доступность = Ложь;
		ОбщегоНазначения.СообщитьПользователю(
			Результат.ТекстИсключения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Отображение) Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы[Параметры.Отображение];
	КонецЕсли;
	
	Если Параметры.СверкаВзаиморасчетовc2b Тогда
		
		КлючиПоиска = Новый Структура;
		КлючиПоиска.Вставить("СверкаВзаиморасчетовc2b", Истина);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"ИдентификаторУчастника",
			СистемаБыстрыхПлатежейСлужебный.УчастникиСБППоНастройкам(КлючиПоиска),
			ВидСравненияКомпоновкиДанных.ВСписке,
			НСтр("ru = 'Идентификатор участника'"),
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Родитель",
			Справочники.НастройкиПодключенияКСистемеБыстрыхПлатежей.ГруппаВариантНастройки(
				Перечисления.ВариантыНастройкиСБП.c2b,
				Ложь,
				Ложь),
			ВидСравненияКомпоновкиДанных.ВИерархии,
			НСтр("ru = 'Сценарий оплаты'"),
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбновитьДанныеФормы",
		ЭтотОбъект);
	
	ПараметрыПодключения = СистемаБыстрыхПлатежейКлиент.НовыйПараметрыПодключения(
		Неопределено,
		Неопределено);
	
	СистемаБыстрыхПлатежейКлиент.ПодключитьСистемуБыстрыхПлатежей(
		ПараметрыПодключения,
		ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление(
		КорневаяГруппа,
		СкрытьНастройки)
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ОформлениеОтбор = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОформлениеОтбор = ОформлениеОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОформлениеОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ОформлениеОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОформлениеОтбор.ПравоеЗначение = Истина;
	
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра(
		"ЦветТекста",
		Метаданные.ЭлементыСтиля.ЦветНеАктивнойСтроки.Значение);
	
	ОформлениеОтбор = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОформлениеОтбор = ОформлениеОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОформлениеОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Используется");
	ОформлениеОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОформлениеОтбор.ПравоеЗначение = Ложь;
	
	Если СкрытьНастройки Или ЗначениеЗаполнено(КорневаяГруппа) Тогда
		
		ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
		ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Истина );
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Отображать",Истина );
		
		ОтборПоГруппе = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоГруппе.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ОтборПоГруппе.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		ОтборПоГруппе.ПравоеЗначение = КорневаяГруппа;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеФормы(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВариантНастройки) Тогда
		ОбновитьДанныеФормыНаСервере();
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормыНаСервере()
	
	СкрытьНастройки = Ложь;
	КорневаяГруппа = Справочники.НастройкиПодключенияКСистемеБыстрыхПлатежей.ГруппаВариантНастройки(
		ВариантНастройки,
		Ложь,
		Ложь);
	Если Не ЗначениеЗаполнено(КорневаяГруппа) Тогда
		СкрытьНастройки = Истина;
	КонецЕсли;
	
	УстановитьУсловноеОформление(
		КорневаяГруппа,
		СкрытьНастройки);
	
КонецПроцедуры

#КонецОбласти
